Repository: alt-atomic/apm
Catalog: po/*.po
Languages: ru

source: Failed to parse repository source
ru: Не удалось разобрать источник репозитория

source: Unknown branch: %s
ru: Неизвестная ветка: %s

source: Unknown repository format: %s
ru: Неизвестный формат репозитория: %s

source: Branch %s has no archive
ru: Ветка %s не имеет архива

source: Archive date should be YYYYMMDD or YYYY/MM/DD format
ru: Дата архива должна быть в формате YYYYMMDD или YYYY/MM/DD

source: Task %s not found or still building
ru: Задача %s не найдена или ещё собирается

source: Invalid repository line: %s
ru: Недопустимая строка репозитория: %s

source: Failed to open %s: %v
ru: Не удалось открыть %s: %v

source: Failed to write to %s: %v
ru: Не удалось записать в %s: %v

source: Failed to read %s: %v
ru: Не удалось открыть %s: %v

source: Failed to remove %s: %v
ru: Не удалось удалить %s: %v

source: Failed to clear %s: %v
ru: Не удалось очистить %s: %v

source: Failed to get task packages: HTTP %d
ru: Не удалось получить пакеты задачи: HTTP %d

source: Inspection information
ru: Информация об инспекции

source: You must specify at least one package
ru: Необходимо выбрать хотя бы один пакет

source: At least one package must be specified
ru: Должно быть указан как минимум один пакет

source: No candidates for removal found
ru: Кандидатов на удаление не найдено

source: Cancel dialog
ru: Отмена диалога

source: %s removed successfully
ru: %s успешно удалён

source: . The system image has not been changed. To apply the changes, run: apm s image apply
ru: . Образ системы не был изменён! Для применения изменений выполните: apm s image apply

source: A repository connection error occurred. The package list has been updated, please try running the command again
ru: Произошла ошибка при подключении к репозиторию. Список пакетов обновлён, пожалуйста, попробуйте запустить команду ещё раз

source: %d package successfully reinstalled
ru: %d пакет успешно переустановлен

source: Package list updated successfully
ru: Список пакетов успешно обновлён

source: DONE
ru: Готово

source: The system has been upgrade successfully
ru: Система была успешно обновлена

source: Package name must be specified, for example info package
ru: Необходимо указать имя пакета, к примеру, info package

source: Nothing found
ru: Ничего не найдено

source: System package
ru: Системный пакет

source: Image status
ru: Статус образа

source: Command executed successfully
ru: Команда успешно выполнена

source: Changes applied successfully. A reboot is required
ru: Изменения были успешно применены. Необходима перезагрука

source: This option is only available for an atomic system
ru: Эта опция доступна только на атомарной системе

source: Modified image. Configuration file:
ru: Образ изменён. Конфигурационный файл:

source: Cloud image without changes
ru: Облачный образ без изменений

source: Build image
ru: Создать образ

source: Apply changes to the host
ru: Применить изменения на хосте

source: Image update
ru: Обновление образа

source: Image changes history
ru: История изменения образа

source: Filter by image name
ru: Фильтрация по имени образа

source: Reinstall packages
ru: Переустановка пакетов

source: Reinstall without confirmation
ru: Переустановить без подтверждения

source: Simulate reinstallation
ru: Симуляция переустановки

source: Package list for installation. The format package- package+ is supported.
ru: Список пакетов для установки. Формат package- и package+ поддерживается.

source: Install without confirmation
ru: Установить без подтверждения

source: List of packages to remove
ru: Список пакетов на удаление

source: Remove without confirmation
ru: Удалить без подтверждения

source: Attempt to remove all files
ru: Попытка удалить все файлы

source: Attempt to remove depends
ru: Попытка удалить зависимости

source: Simulate removal
ru: Симуляция удаления

source: Updating package database
ru: Обновление базы данных пакетов

source: Skip file locking (use with caution)
ru: Пропустить блокировку файла (использовать с осторожностью)

source: General system upgrade
ru: Общее обновление системы

source: Full output of information
ru: Полный вывод информации

source: Only installed
ru: Только установленные

source: Full information output
ru: Полный вывод информации

source: Building a query to get a list of packages
ru: Создание запроса для получения списка пакетов

source: Sort packages by field, example fields: name, section
ru: Сортировать пакеты по полю, примеры полей: имя, раздел

source: Force update all packages before query
ru: Принудительное обновление всех пакетов до запроса

source: Module for working with the image
ru: Модуль для работы с образом

source: System package management
ru: Управление системными пакетами

source: Failed to parse JSON: %w
ru: Не удалось спарсить JSON: %w

source: Edit
ru: Изменить

source: Abort
ru: Прервать

source: Upgrade
ru: Обновить

source: Error starting TEA: %v
ru: Ошибка запуска TEA: %v

source: Navigation: ↑/↓ or j/k - select, Ctrl+↑/↓ or PgUp/PgDn - scroll, Ctrl+Home/End - top/bottom, Enter - choose, Esc/q - cancel
ru: Навигация: ↑/↓ или j/k - выбор, Ctrl+↑/↓ или PgUp/PgDn - прокрутка, Ctrl+Home/End - начало/конец, Enter - выбор, Esc/q - отмена

source: Select an action:
ru: Выберите действие:

source: Affected changes:
ru: Затронутые изменения:

source: Extra packages
ru: Будет добавлено

source: Will be updated
ru: Будет обновлено

source: Will be installed
ru: Будет установлено

source: Will be removed
ru: Будет удалено

source: %d package
ru: %d пакет

source: Total:
ru: Итого:

source: Not affected
ru: Не затронуто

source: Package information:
ru: Информация о пакете:

source: Package list:
ru: Список пакетов:

source: [Installed]
ru: [Установлено]

source: Package %d:
ru: Пакет %d:

source: No
ru: Нет

source: Yes
ru: Да

source: Action
ru: Действие

source: Category
ru: Категория

source: Repository version
ru: Версия в репозитории

source: System version
ru: Версия в системе

source: and others
ru: и другие

source: Apply
ru: Применить

source: Select packages to apply
ru: Выберите пакеты для применения

source: Navigation: ↑/↓/j/k - move, ←/→ - switch panel, Tab - next area, Space - toggle, a - all, n - none, Enter - apply, Esc/q - cancel
ru: Навигация: ↑/↓ - движение, ←/→ - переключение панели, Tab - следующая область, Space - переключение, a - выбрать всё, n - снять всё, Enter - применить, Esc/q - отмена

source: No packages
ru: Нет пакетов

source: Start session D-Bus service org.altlinux.APM
ru: Запустить сессионный сервис D-Bus org.altlinux.APM

source: Enable verbose logging to stdout
ru: Включить подробное логирование в стандартный вывод

source: Start system D-Bus service org.altlinux.APM
ru: Запустить системный сервис D-Bus org.altlinux.APM

source: Listen address (host:port)
ru: Адрес прослушивания (хост:порт)

source: API token for authentication
ru: API-токен для аутентификации

source: Show the list of commands or help for each command
ru: Показать список команд или справку по каждой команде

source: [command]
ru: [команда]

source: Print version
ru: Показать версию

source: Output format: json, text
ru: Формат вывода: json, text

source: Internal property, adds the transaction to the output
ru: Внутреннее свойство, добавляющее транзакцию к выводу

source: Recieved correct signal %s. Stopping application…
ru: Получен правильный сигнал %s. Остановка приложения…

source: Unexpected signal %s received. Terminating the application with an error.
ru: Получен неожиданный сигнал %s. Завершение работы приложения с ошибкой.

source: Unknown command: %s. See 'apm help'
ru: Неизвестная команда: %s. Посмотрите 'apm help'

source: Administrator privileges are required to start
ru: Требуются привилегии администратора для запуска

source: failed to close DBus: %w
ru: Не удалось закрыть DBus: %w

source: failed to close databases: %w
ru: Не удалось закрыть базы данных: %s

source: Updating apm database
ru: Обновление базы данных apm
