Repository: alt-atomic/apm
Catalog: po/*.po
Languages: ru

source: error opening system database: %w
ru: Ошибка открытия системной базы данных: %w

source: Elevated rights are required to perform this action. Please use sudo or su
ru: Для выполнения этого действия необходимы повышенные права. Пожалуйста, используйте sudo или su

source: error connecting to system database: %w
ru: Ошибка подключения к системной базе данных: %w

source: error opening user database: %w
ru: Ошибка открытия сессионной базы данных: %w

source: error connecting to user database: %w
ru: Ошибка подключения к сессионной базе данных: %w

source: error opening key-value database: %w
ru: Ошибка открытия key-value базы данных: %w

source: failed to connect to DBus: %w
ru: Ошибка подключения к DBus: %w

source: failed to request DBus name: %w
ru: Не удалось запросить имя DBus: %s

source: Interface org.altlinux.APM is already in use
ru: Интерфейс org.altlinux.APM уже используется

source: failed to close DBus connection: %w
ru: Не удалось закрыть соединение DBus: %w

source: Cannot read dir %s: %w
ru: Невозможно прочитать директорию %s: %w

source: Read file %s failed: %w
ru: Не удалось прочитать файл %s: %w

source: Unpack %s failed: %w
ru: Не удалось распаковать %s: %w

source: Parse %s failed: %w
ru: Не удалось спарсить %s: %w

source: Broken packages
ru: Повреждённые пакеты

source: You have no permissions for that
ru: Недостаточно прав для этого

source: Internal Error, InstallPackages was called with broken packages!
ru: Внутренняя ошибка, InstallPackages был вызван для повреждённых пакетов!

source: Packages need to be removed but Remove is disabled.
ru: Пакеты необходимо удалить, но Remove выключен.

source: Unable to lock the download directory
ru: Невозможно заблокировать директорию загрузки

source: There are problems and -y was used without --force-yes
ru: Обнаружены проблемы, и -y был использован без --force-yes

source: You don't have enough free space in %s
ru: Недостаточно места в %s

source: Package file %s is out of sync
ru: Файл пакета %s не синхронизирован

source: Trivial Only specified but this is not a trivial operation
ru: Указана только тривиальная операция, но это не тривиальная операция

source: Operation cancelled
ru: Операция отменена

source: Must specify at least one package to check builddeps for
ru: Должен быть указан хотя бы один пакет для проверки зависимостей сборки для %s

source: Unable to find a source package for %s
ru: Невозможно найти пакет-источник для %s

source: Unable to get build-dependency information for %s
ru: Невозможно получить информацию о зависимостях сборки для %s

source: Some broken packages were found while trying to process build-dependencies for %s
ru: Было найдено несколько повреждённых пакетов во время попытки вычисления зависимостей сборки для %s

source: Package %s is a virtual package with no good providers
ru: Пакет %s является виртуальным без хороших поставщиков

source: Package %s is a virtual package with multiple good providers
ru: Пакет %s является виртуальным с несколькими хороших поставщиков

source: No packages found
ru: Не найдено пакетов

source: Package %s is not installed, so not removed
ru: Пакет %s не установлен, поэтому не удалён

source: Release %s'%s' for '%s' was not found
ru: Релиз %s'%s' для '%s' не найден

source: Version %s'%s' for '%s' was not found
ru: Версия %s'%s' для '%s' не найден

source: Sources list %s could not be read
ru: Список источников %s не может быть прочтён

source: Sources list %s doesn't exist
ru: Списка источников %s не существует

source: Excessive arguments
ru: Избыточные аргументы

source: Internal Error, problem resolver broke stuff
ru: Внутренняя ошибка, средство решения проблем сломало что-то

source: Internal Error, Ordering didn't finish
ru: Внутренняя ошибка, заказ не был выполнен

source: Some files failed to download
ru: Некоторые файлы не были скачены

source: Unable to fetch some archives, maybe run apt-get update or try with --fix-missing?
ru: Невозможно извлечь некоторые архивы, возможно стоит попробовать запустить apt-get update или запустить с --fix-missing?

source: --fix-missing and media swapping is not currently supported
ru: --fix-missing и смена медиа сейчас не поддерживаются

source: Unable to correct missing packages
ru: Невозможно исправить отсутствующие пакеты

source: Aborting Install
ru: Прервать установку

source: Could not open RPM database
ru: Не удалось открыть базу данных RPM

source: Couldn't parse name '%s'
ru: Не удалось спарсить имя '%s'

source: Write to stdout failed
ru: Запись в канал стандартного вывода не удалась

source: Exceeded maximum number of command arguments
ru: Привышено максимальное количество аргументов команды

source: Package %s dependency for %s cannot be satisfied because the package %s cannot be found
ru: Пакет-зависимость %s для %s не может быть разрешён, так как пакет %s не может быть найден

source: Regex compilation error - %s
ru: Ошибка обработки регулярного выражения - %s

source: Package %s has no installation candidate
ru: Пакет %s не имеет кандидатов для установки

source: Internal Error, AllUpgrade broke stuff
ru: Внутренняя ошибка, AllUpgrade что-то сломал

source: Requested autoremove failed.
ru: Требуемое автоудаление не выполнено.

source: Couldn't find package %s
ru: Не удалось найти пакет %s

source: %s dependency for %s cannot be satisfied
ru: Зависимость %s для %s не может быть разрешена

source: Failed to satisfy %s dependency for %s: Installed package %s is too new
ru: Не удалось разрешить зависимость %s для %s: Установленный пакет %s слишком новый

source: Failed to satisfy %s dependency for %s: %s
ru: Не удалось разрешить зависимость %s для %s: %s

source: You must give exactly one pattern
ru: Необходимо передать хотя бы один паттерн

source: No help for that
ru: Нет справки для этого

source: %s is already the newest version.
ru: Версия %s уже самая новая.

source: The list of sources could not be read.
ru: Список источников не может быть прочитан.

source: There are changes to be made
ru: Необходимо внести некоторые изменения

source: Failed to fetch some archives.
ru: Не удалось извлечь некоторые архивы.

source: Failed to fetch %s %s
ru: Не удалось извлечь %s %s

source: Some index files failed to download. They have been ignored, or old ones used instead.
ru: Не удалось загрузить некоторые индексные файлы. Они были проигнорированы или вместо них были использованы старые файлы.

source: 'apt-get upgrade' is disabled because it can leave system in a broken state.
ru: 'apt-get upgrade' выключен, потому что это может повредить состояние системы.

source: Unmet dependencies. Try 'apt-get --fix-broken install' with no packages (or specify a solution).
ru: Неразрешённые зависимости. Попробуйте 'apt-get --fix-broken install' без пакетов (или укажите решение).

source: Must specify at least one package to fetch source for
ru: Должен быть указан хотя бы один пакет для извлечения из источника для

source: Fatal: conflicts violated %s
ru: Критично: конфликты %s нарушены

source: Child process failed
ru: Ошибка дочернего процесса

source: Must specify at least one package to get changelog for
ru: Необходимо указать хотя бы один пакет для получения изменений для

source: Failed to process build dependencies
ru: Не удалось просчитать зависимости сборки

source: Package %s is a virtual package with no
ru: Пакет %s является виртуальным пакетом без

source: Package %s is a virtual package with multiple
ru: Пакет %s является виртуальным с несколькими

source: Failed to initialize APT configuration
ru: Не удалось инициализировать конфигурацию APT

source: Invalid system pointer
ru: Неверный системный указатель

source: Failed to initialize APT system
ru: Не удалось инициализировать систему APT

source: Invalid arguments for cache_open
ru: Неверные аргументы для cache_open

source: System not properly initialized
ru: Система инициализирована некорректно

source: Unable to acquire APT system lock - another process may be using APT
ru: Не удается получить системную блокировку APT — возможно, другой процесс использует APT

source: Failed to open APT cache
ru: Не удалось открыть кеш APT

source: Failed to check dependencies
ru: Не удалось проверить зависимости

source: Failed to get dependency cache
ru: Не удалось получить кеш зависимостей

source: Failed to reopen cache after refresh
ru: Не удалось переоткрыть кеш после обновления

source: Failed to check dependencies after refresh
ru: Не удалось проверить зависимости после обновления

source: Failed to get dependency cache after refresh
ru: Не удалось получить кеш зависимость зависимостей после обновления

source: Failed to get package indexes
ru: Не удалось получить индексы пакета

source: Failed to download package lists
ru: Не удалось загрузить списки пакетов

source: Failed to rebuild caches
ru: Не удалось пересобрать кеши

source: Invalid cache or output pointer for pm create
ru: Неверный кеш или выподной указатель для pm create

source: Failed to create package manager
ru: Не удалось создать менеджер пакетов

source: Invalid arguments for mark_install
ru: Неверные аргументы для mark_install

source: Invalid arguments for mark_remove
ru: Неверные аргументы для mark_remove

source: Problem resolver failed to handle package removal dependencies
ru: Средству устранения неполадок не удалось обработать зависимости удаляемого пакета

source: Invalid arguments for mark_keep
ru: Неверные аргументы для mark_keep

source: Invalid arguments for mark_auto
ru: Неверные аргументы для mark_auto

source: Invalid package manager instance
ru: Неверный экземпляр менеджера пакетов

source: Cannot install packages with broken dependencies
ru: Не удалось установить пакеты со сломаными зависимостями

source: Failed to get package archives
ru: Не удалось получить архивы пакетов

source: Failed to download packages
ru: Не удалось загрузить пакеты

source: Package manager operation failed
ru: Неудачная операция менеджера пакетов

source: Package manager operation incomplete
ru: Незавершённая операция менеджера пакетов

source: Unknown package manager result
ru: Управление системными пакетами

source: Failed to update package marks
ru: Не удалось обновить базу данных пакетов: %s, ошибка: %s

source: Invalid cache for dist upgrade
ru: Неверный кеш для обновления дистрибутива

source: Distribution upgrade failed
ru: Неудачное обновление дистрибутива

source: Failed to create package manager for dist upgrade
ru: Не удалось создать менеджер пакетов для обновления дистрибутива

source: Failed to get package archives for dist upgrade
ru: Не удалось получить архивы пакетов для обновления дистрибутива

source: Failed to download packages for dist upgrade
ru: Не удалось скачать пакеты для обновления дистрибутива

source: Failed to update package marks after dist upgrade
ru: Не удалось обновить помеченные пакеты после обновления дистрибутива

source: Invalid parameters for search
ru: Неверные параметры для search

source: Failed to compile regex pattern
ru: Не удалось скомпилировать регулярное выражение

source: Failed to create package records parser
ru: Не удалось создать парсер записей пакетов

source: Failed to allocate memory for search results
ru: Не удалось выделить память для результатов поиска

source: Unknown exception in search
ru: Неизвестное исключение в поиске

source: Invalid parameters for get_package_info
ru: Неверные параметры для get_package_info

source: Invalid parameters for simulation
ru: Неверные параметры для симуляции

source: Cache file not available
ru: Файл кеша неодступен

source: Invalid parameters for multi-package simulation
ru: Неверные параметры для симуляции нескольких пакетов

source: Virtual package %s has no installable providers
ru: Виртуальный пакет %s не имеет устанавливаемых поставщиков

source: Virtual package %s has multiple providers. Please select specific package.
ru: Виртуальный пакет %s имеет несколько поставщиков . Пожалуйста, выберите конкретный пакет.

source: Package not found: %s
ru: Пакет не найден: %s

source: Package is not installed: %s
ru: Пакет не установлен: %s

source: Package %s has no installed providers
ru: Пакет %s не имеет поставщиков для установки

source: Virtual package %s has multiple installed providers: %s. Please remove specific package.
ru: Виртуальный пакет %s имеет несколько установленных поставщиков: %s. Пожалуйста, удалите конкретный пакет.

source: Dist upgrade simulation failed: %s
ru: Неудачная симуляция обновления дистрибутива: %s

source: Multi-package install simulation failed: %s
ru: Неудачная симуляция установки нескольких пакетов: %s

source: Multi-package remove simulation failed: %s
ru: Неудачная симуляция удаления нескольких пакетов: %s

source: Combined simulation failed: %s
ru: Неудачная комбинированная симуляция: %s

source: Virtual name '%s' has multiple providers; specify exact package name
ru: Виртуальное имя '%s' имеет несколько поставщиков; укажите точное имя пакета

source: Cannot remove %s not installed
ru: Нельзя удалить %s не установлен

source: Cannot remove essential package %s
ru: Нельзя удалить базовый системный пакет %s

source: Cannot remove %s. Try removing together: %s
ru: Нельзя удалить %s. Попробуйте удалить совместно: %s

source: Broken dependencies
ru: Поломанные зависимости

source: Virtual package %s is provided by: %s You should explicitly select one to install
ru: Виртуальный пакет %s предоставлен: %s Вам следует явно выбрать один из пакетов для установки

source: Repository update failed: %s
ru: Ошибка обновления репозитория: %s

source: Package index update failed: %s
ru: Ошибка обновления индекса для пакетов: %s

source: Conflicting packages: %s and %s
ru: Конфликтующие пакеты: %s и %s

source: Some packages could not be installed. This may mean that you have requested an impossible situation
ru: Некоторые пакеты не удалось установить. Это может означать, что вы запросили невозможную ситуация для разрешения

source: Packages are already installed: %s
ru: Пакеты уже установлены: %s

source: RPM package unpacking failed: %s. The package may be incompatible with the current system or requires special permissions
ru: Ошибка распаковки RPM пакета: %s. Пакет может быть несовместим с текущей системой или требует специальных разрешений

source: No packages found matching the specified patterns
ru: Не найдено пакетов, соответствующих указанным шаблонам

source: Downloading packages
ru: Загрузка пакетов

source: All packages downloaded
ru: Загрузка всех пакетов

source: Installing progress: %s
ru: Прогресс установки: %s

source: Installing %s
ru: Установка %s

source: AppStream load failed: %v
ru: Не удалось загрузить AppStream: %v

source: Error updating information about installed packages: %w
ru: Ошибка обновления информации об установленных пакетах: %w

source: Table cleanup error: %w
ru: Ошибка очистки таблицы: %w

source: Batch insert error: %w
ru: Ошибка пакетной вставки: %w

source: Failed to get information about the package %s
ru: не удалось извлечь информацию о пакете %s

source: Temporary table drop error: %w
ru: Ошибка создания временной таблицы: %w

source: Temporary table creation error: %w
ru: Ошибка создания временной таблицы: %w

source: Batch insert into temporary table error: %w
ru: Ошибка пакетной вставки во временную таблицу: %w

source: Batch update error: %w
ru: Ошибка пакетного обновления

source: Query execution error: %w
ru: Ошибка исполнения запроса

source: Invalid sort field: %s. Available fields: %s
ru: Некорректное поле сортировки: %s. Доступные поля: %s

source: Package count error: %w
ru: Ошибка количества пакетов: %w

source: Invalid filter field: %s. Available fields: %s
ru: Некорректное поле фильтра: %s. Доступные поля: %s

source: Table %s exists but contains no records
ru: Таблица %s существует, но не содержит записей

source: lock file
ru: файл блокировки

source: Package operations are locked by %s (PID %d)%s
ru: Работа с пакетами заблокирована процессом %s (PID %d)%s

source: Package operations are locked by process with PID %d%s
ru: Работа с пакетами заблокирована процессом с PID %d%s

source: Package operations are locked by another process%s
ru: Работа с пакетами заблокирована другим процессом%s

source: Error executing the rpm -qia command: %w
ru: Ошибка выполнения команды rpm -qia: %w

source: failed to query installed kernels: %s
ru: не удалось запросить установленные ядра: %s

source: error scanning RPM output: %w
ru: ошибка сканирования вывода RPM: %w

source: error scanning RPM output: %s
ru: ошибка сканирования вывода RPM: %s

source: Configuration not loaded. Load config first
ru: Конфигурация не загружена. Сначала загрузите конфигурацию

source: '%s' type doesn't support output
ru: Тип '%s' не поддерживает вывод

source: Failed to retrieve information about the package %s
ru: Не удалось извлечь информацию о пакете %s

source: . Maybe you were looking for:
ru: . Возможно, вы искали:

source: module with id='%s'%s will be overriding%s
ru: модуль с id='%s'%s будет переопределять %s

source: Configuration not loaded
ru: Конфигурация не загружена

source: unknown expr output type
ru: неизвестный тип вывода выражения

source: Image can not be empty
ru: Образ не может быть пустым

source: Invalid id '%s'. Acceptable characters are letters, numbers, and underscores. The key must start with a letter.
ru: Недопустимый идентификатор '%s'. Допустимыми символами являются буквы, цифры и подчеркивания. Ключ должен начинаться с буквы.

source: circular include detected: %s
ru: Обнаружено циклическое добавление: %s

source: include target not found: %s
ru: Цель не найдена: %s

source: SQLite connection error via GORM: %w
ru: Ошибка подключения к SQLite через GORM: %w

source: Table structure migration error: %w
ru: Ошибка миграции структуры таблицы: %w

source: Config conversion error: %v
ru: Ошибка преобразования конфигурации: %v

source: Error parsing date %s: %v
ru: Ошибка парсинга даты %s: %v

source: Error serializing config: %v
ru: Ошибка сериализации кофигурации: %v

source: Error inserting data: %v
ru: Ошибка ввода данных: %v

source: History not found
ru: История не найдена

source: Query execution error: %v
ru: Ошибка выполнения запроса: %v

source: History config conversion error: %v
ru: Ошибка преобразования истории конфигурации: %v

source: Failed to execute bootc command: %v
ru: Не удалось выполнить команду bootc: %v

source: Failed to parse JSON: %v
ru: Не удалось спарсить JSON: %v

source: Access error to /proc/mounts: %v
ru: Ошибка доступа к /proc/mounts: %v

source: Failed to close /proc/mounts: %v
ru: Не удалось закрыть /proc/mounts: %v

source: Error activating usr-overlay: %s
ru: Ошибка активации usr-overlay: %s

source: Error building image: %s status: %d
ru: Ошибка сборки образа: %s статус: %d

source: Error podman image: %v
ru: Ошибка образа podman: %v

source: No valid images with tag 'os'. Please build the image first.
ru: Нет корректных образов с тегом 'os'. Пожалуйста, сперва соберите образ.

source: Error switching to the new image: %s
ru: Ошибка перехода на новый образ: %s

source: Error retrieving information: %v
ru: Ошибка извлечения информации: %v

source: Failed to generate Containerfile: %w
ru: Не удалось создать Containerfile: %w

source: Skopeo inspect error: %v
ru: Ошибка инспектирования Skopeo: %w

source: Failed to parse skopeo inspect: %w
ru: Не удалось обработать skopeo ответ: %w

source: Bootc upgrade failed: %v
ru: Ошибка обновления через bootc: %s

source: Failed to determine the distribution image: %w. Please specify it in %s
ru: Не удалось определить образ дистрибутива: %w. Пожалуйста укажите их в %s

source: The image has not changed, build paused
ru: Образ не был изменён, остановка сборки

source: Failed to open file %s: %w
ru: Не удалось открыть файл %s: %2

source: Error reading file %s: %w
ru: Ошибка чтения файла %s: %w

source: Failed to determine the distribution image in %s
ru: Не удалось определить образ дистрибутива в %s

source: unknown initrd method %s
ru: неизвестный метод initrd %s

source: failed to parse kernel package from database
ru: не удалось проанализировать пакет ядра из базы данных

source: target in link type must be absolute path
ru: цель в типе ссылки должна быть абсолютным путем

source: path %s for link doesn't exists
ru: путь %s для ссылки не существует

source: unknown branch %s
ru: неизвестная ветвь %s

source: Command failed with error: %v, output: %s
ru: Команда завершилась с ошибкой: %v, вывод: %s

source: Error deleting old images: %v, output: %s
ru: Ошибка удаления старых образов: %v, вывод: %s

source: Error retrieving podman image: %v
ru: Ошибка извлечения образа podman: %v

source: Error deleting image %s: %v, output: %s
ru: Ошибка удаления образа %s: %v, вывод: %s

source: Fetching layers %d/%d
ru: Получение слоёв %d/%d

source: polkit dbus failure: %w
ru: polkit dbus ошибка: %w

source: polkit unpack failure: %w
ru: polkit, ошибка распаковки: %w

source: not authorized by polkit (action=%s)
ru: не авторизовано polkit (действие=%s)

source: version not found
ru: версия не найдена

source: %.2f MB
ru: %.2f МБ

source: show help
ru: Показать помощь

source: print the version
ru: Показать версию

source: Module:
ru: Модуль:

source: Usage:
ru: Применение:

source: Description:
ru: Описание:

source: Commands:
ru: Команды:

source: Options:
ru: Параметры:

source: Category:
ru: Категория:

source: Global options:
ru: Глобальные параметры:

source: default
ru: по умолчанию

source: Icon for package %s not found: %v
ru: Иконка пакета %s не найдена: %v

source: Error saving icon %s: %v
ru: Ошибка при сохранении иконки %s: %v

source: Error calculating icon statistics:
ru: Ошибка вычисления статистики иконки:

source: Total number of icons in the database: %d, total size: %d bytes
ru: Общее количество иконок в базе данных: %d, общий размер: %d байт

source: Error preparing temporary directories: %v
ru: Ошибка подготовки временных директорий: %v

source: Error checking the existence of the icon in the database:
ru: Ошибка проверки существования иконки в базе данных:

source: Error retrieving icon: %s
ru: Ошибка извлечения иконки: %s

source: Error compressing the icon:
ru: Ошибка сжатия иконки:

source: Error writing icon %s to the database: %v
ru: Ошибка записи иконки %s в базу данных: %v

source: Icon %s not found
ru: Иконка %s не найдена

source: Error unpacking icon %s: %v
ru: Ошибка распаковки иконки %s: %v

source: Error copying from container: %v, stderr: %s
ru: Ошибка копирования из контейнера: %v, ошибка: %s

source: File %s not found in %s
ru: Файл %s не найден в %s

source: Icon not found for package %s
ru: Иконка не найдена для пакета %s

source: Failed to read directory %s: %w
ru: Не удалось прочитать директорию %s: %w

source: Error retrieving files in %s: %v, stderr: %s
ru: Ошибка извлечения файлов в %s: %v, ошибка: %s

source: Failed to read file %s: %w
ru: Не удалось прочитать файл %s: %w

source: Error executing command for file %s: %v, stderr: %s
ru: Ошибка выполнения команды для файла %s: %v, ошибка: %s

source: Failed to unpack file %s: %w
ru: Не удалось распаковать файл %s: %w

source: Error parsing XML file %s: %w
ru: Ошибка парсинга XML-файла %s: %w

source: invalid length: expected 9 characters, got %d
ru: неверная длина: ожидалось 9 символов, получено %d

source: Wrong permission format
ru: Неправильный формат разрешения

source: DBus connection is not initialized
ru: Соединение DBus не было инициализировано

source: Error sending notification: %v
ru: Ошибка отправки уведомления: %v

source: Saving packages to the database
ru: Сохранение пакетов в базу данных

source: Requesting list of containers
ru: Запрос списка контейнеров

source: Exporting package
ru: Экспортирование пакета

source: Requesting container information
ru: Запрос информации о контейнере

source: Creating container
ru: Создание контейнера

source: Deleting container
ru: Удаление контейнера

source: Installing package
ru: Установка пакета
