Repository: alt-atomic/apm
Catalog: po/*.po
Languages: ru

source: Removing package
ru: Удаление пакета

source: Retrieving list of packages
ru: Извлечение списка пакетов

source: Determining file owner
ru: Определение владельца файла

source: Searching package paths
ru: Поиск путей пакета

source: Retrieving package information
ru: Извлечение информации о пакете

source: Updating packages
ru: Обновление пакетов

source: Filtering packages
ru: Фильтрация пакетов

source: Working with packages
ru: Работа с пакетами

source: System update
ru: Обновление системы

source: Analyzing packages
ru: Анализ пакетов

source: General update process
ru: Общий процесс обновления

source: General update kernel
ru: Общий процесс обновления

source: Loading package list from STPLR repository
ru: Загрузка списка пакетов из репозитория STPLR

source: Loading package list from ALT repository
ru: Загрузка списка пакетов из репозитория ALT

source: Saving image history to the database
ru: Сохранение истории образа в базу данных

source: Building local image
ru: Создание локального образа

source: Switching to local image
ru: Переключение на локальный образ

source: General Image Update Process
ru: Общий процесс обновления образа

source: Downloading base image update
ru: Загрузка обновления базового образа

source: Cleaning up old images
ru: Очистка старых образов

source: Synchronizing database
ru: Синхронизация базы данных

source: Update information about applications
ru: Обновить информацию о приложениях

source: Get current kernel
ru: Получить актуальное ядро

source: Get list kernels
ru: Получить список ядер

source: Install kernel
ru: Установить ядро

source: Install kernel modules
ru: Установить модули ядра

source: Remove packages
ru: Удаление пакетов

source: Simulate Remove packages
ru: Симуляция удаления пакетов

source: Executing tasks
ru: Выполнение задач

source: Progress completed
ru: Прогресс завершён

source: Progress: %s completed
ru: Прогресс: %s завершён

source: %T (unknown type)
ru: %T (неизвестный тип)

source: %T (slice of unknown type)
ru: %T (фрагмент неизвестного типа)

source: %s: no
ru: %s: нет

source: yes
ru: да

source: no
ru: нет

source: Aliases
ru: Псевдонимы

source: Desktop Paths
ru: Пути приложений

source: Console Paths
ru: Консольные пути

source: Architecture
ru: Архитектура

source: Result
ru: Результат

source: Application Information
ru: Информация о приложении

source: Downloaded Size
ru: Размер при загрузке

source: Installed Size
ru: Размер при установке

source: Package
ru: Пакет

source: This Application
ru: Это приложение

source: Type Package
ru: Тип пакета

source: Count
ru: Количество

source: Console Application
ru: Консольная утилита

source: Package Information
ru: Информация о пакете

source: Install
ru: Установить

source: Storage Type
ru: Тип хранилища

source: Date
ru: Дата

source: Image Digest
ru: Дайджест образа

source: Distribution
ru: Дистрибутив

source: Container
ru: Контейнер

source: Name
ru: Название

source: Extra Installed
ru: Дополнительно установлено

source: Upgraded Count
ru: Количество обновлённых

source: Booted Image
ru: Загруженный образ

source: Removed Packages
ru: Удалённые пакеты

source: Provides
ru: Обеспечивает

source: Providers
ru: Поставщики

source: Version
ru: Версия

source: History
ru: История

source: Dependencies
ru: Зависимости

source: Removed Count
ru: Количество удалённых

source: Upgraded Packages
ru: Обновлённые пакеты

source: Package Name
ru: Имя пакета

source: Image
ru: Образ

source: Commands
ru: Команды

source: Maintainer
ru: Сопровождающий

source: Installed Version
ru: Установленная версия

source: Remove
ru: Удалить

source: Containers
ru: Контейнеры

source: Paths
ru: Пути

source: Description
ru: Описание

source: Newly Installed Count
ru: Количество свежеустановленных

source: Active
ru: Активно

source: Information
ru: Информация

source: Total Count
ru: Общее количество

source: Installed
ru: Установлено

source: Package Manager
ru: Пакетный менеджер

source: Last Changelog
ru: Последние изменения

source: Section
ru: Секция

source: Specification
ru: Спецификация

source: Booted
ru: Загружено

source: Staged
ru: Зафиксированно

source: Size
ru: Размер

source: Newly Installed Packages
ru: Свежеустановленные пакеты

source: Not Upgraded Count
ru: Количество не обновлённых

source: Container Name
ru: Имя контейнера

source: Configuration
ru: Конфигурация

source: Exporting
ru: Экспортировано

source: Status
ru: Статус

source: Image Date
ru: Дата образа

source: Packages
ru: Пакеты

source: Filename
ru: Имя файла

source: Container Information
ru: Информация о контейнере

source: Image Name
ru: Имя образа

source: Transport
ru: Транспорт

source: Pinned
ru: Закреплено

source: List
ru: Список

source: Kernel
ru: Ядро

source: Kernels
ru: Ядра

source: Current Kernel
ru: Текущее ядро

source: Latest Kernel
ru: Последнее ядро

source: Preview
ru: Предварительный просмотр

source: Age in Days
ru: Возраст в днях

source: Build Time
ru: Время сборки

source: Flavour
ru: Разновидность

source: Full Version
ru: Полная версия

source: Is Installed
ru: Установлено

source: Is Running
ru: Запущено

source: Release
ru: Релиз

source: Modules
ru: Модули

source: Kept
ru: Сохранённый

source: Reasons
ru: Причины

source: Version Raw
ru: Полная версия

source: Kept Kernels
ru: Сохранённые ядра

source: Remove kernels
ru: Удаляемые ядра

source: Installed Modules
ru: Установленные модули

source: Selected Modules
ru: Выбранные модули

source: Missing Modules
ru: Отсутствующие модули

source: Available Update
ru: Доступно обновление

source: Summary
ru: Краткое описание

source: Repositories
ru: Репозитории

source: Added
ru: Добавлено

source: Removed
ru: Удалено

source: Arch
ru: Архитектура

source: Key
ru: Ключ

source: Components
ru: Компоненты

source: File
ru: Файл

source: Type
ru: Тип

source: Branches
ru: Ветки

source: Branch
ru: Ветка

source: Task num
ru: Номер задачи

source: Entry
ru: Запись

source: WillAdd
ru: Будет добавлено

source: WillRemove
ru: Будет удалено

source: Elevated rights are not allowed to perform this action. Please do not use sudo or su
ru: Действие не допускает выполнения с повышенными правами. Не используйте sudo или su

source: Package list successfully updated
ru: Список пакетов успешно обновлён

source: You must specify the package name, for example `%s package`
ru: Необходимо указать имя пакета, к примеру `%s package`

source: Package found
ru: Найден пакет

source: %d record found
ru: Найдена %d запись

source: Package %s installed
ru: Пакет %s установлен

source: Package %s removed
ru: Пакет %s удалён

source: No containers found
ru: Контейнеры не найдены

source: You must specify the image link (--image)
ru: Необходимо указать ссылку на образ (--image)

source: You must specify the container name (--name)
ru: Необходимо указать имя контейнера (--name)

source: Container %s successfully created
ru: Контейнер %s успешно создан

source: Container %s successfully deleted
ru: Контейнер %s успешно удалён

source: Error deleting container: %v
ru: Ошибка удаления контейнера: %s

source: You must specify the container name
ru: Необходимо указать имя контейнера

source: Failed to delete container records: %w
ru: Не удалось удалить записи контейнера: %w

source: Managing packages and containers in distrobox
ru: Управление пакетами и контейнерами в distrobox

source: Update and synchronize the list of installed packages with the host
ru: Обновить и синхронизировать список установленных пакетов с хостом

source: Container name. Required
ru: Имя контейнера. Обязательно

source: Package information
ru: Информация о пакете

source: Quick package search by name
ru: Быстрый поиск пакета по имени

source: Container name. Optional flag
ru: Имя контейнера. Необязательный флаг

source: Building query to retrieve package list
ru: Построение запроса для извлечения списка пакетов

source: Field for sorting, for example: name, version
ru: Поле для сортировки, к примеру: name, version

source: Sorting order: ASC or DESC
ru: Направление сортировки: по возрастанию (ASC) или по убыванию (DESC)

source: Maximum number of records to return
ru: Максимальное количество возвращаемых записей

source: Starting position (offset) for the result set
ru: Начальная позиция (смещение) для результата выборки

source: Filter in the format key=value. The flag can be specified multiple times, for example: --filter name=zip --filter installed=true
ru: Фильтр в формате ключ=занчение. Флаг может быть указан несколько раз, к примеру: --filter name=zip --filter installed=true

source: Force update all packages before the request
ru: Принудительное обновление всех пакетов перед запросом

source: Install package
ru: Установка пакета

source: Export package
ru: Экспорт пакета

source: Remove package
ru: Удаление пакета

source: Remove only from host, leave package in container
ru: Удалить только с хоста, оставить пакет в контейнере

source: Show dbus online documentation
ru: Показать онлайн-документацию по dbus

source: Module for working with containers
ru: Модуль для работы с контейнерами

source: List of containers
ru: Список контейнеров

source: Add container
ru: Добавить контейнер

source: Container. Must be specified, options: alt, ubuntu, arch
ru: Контейнер. Должен быть указан, опции: alt, ubuntu, arch

source: Container name
ru: Имя контейнера

source: The value for image must be one of: alt, ubuntu, arch
ru: Значение для образа, одно из: alt, ubuntu, arch

source: Manual container addition
ru: Ручное добавление контейнера

source: Image link. Required
ru: Ссылка на образ. Обязательно

source: List of packages to install
ru: Список пакетов для установки

source: Calling hook to execute commands
ru: Вызов обработчика для исполнения команд

source: Remove container
ru: Удалить контейнер

source: Failed to update package database: %v, stderr: %s
ru: Не удалось обновить базу данных пакетов: %s, ошибка: %s

source: Error opening stdout pipe: %w
ru: Ошибка открытия канала стандартного вывода: %w

source: Error executing command: %w
ru: Ошибка исполнения команды: %w

source: Error retrieving installed packages:
ru: Ошибка извлечения установленных пакетов:

source: String too large: (over %dMB) -
ru: Строка слишком велика: (больше, чем %dMB) -

source: Scanner error: %w
ru: Ошибка сканера: %w

source: Command execution error: %w
ru: Ошибка исполнения команды: %w

source: Failed to remove package %s: %v, stderr: %s
ru: Не удалось удалить пакет %s: %v, ошибка: %s

source: Failed to install package %s: %v, stderr: %s
ru: Не удалось установить пакет %s: %v, ошибка: %s

source: Command execution error: %s %s
ru: Ошибка исполнения команды: %s %s

source: Fallback command execution error: %s %s
ru: Ошибка выполнения резервной команды: %s %s

source: Fallback search found %d files
ru: Резервный поиск нашел %d файлов

source: Error executing command rpm -qia: %w
ru: Ошибка исполнения команды rpm -qia: %w

source: Error scanning rpm output: %w
ru: Ошибка сканирования вывода rpm

source: Failed to search packages (pacman -Ss): %v, stderr: %s
ru: Не удалось найти пакеты (pacman -Ss): %v, ошибка: %s

source: Error parsing official packages: %v
ru: Ошибка парсинга официальных пакетов: %v

source: Failed to recognize the owner for file '%s'
ru: Не удалось распознать владельца файла '%s'

source: Failed to find a package for file '%s': %v, stderr: %s
ru: Не удалось найти пакет для файла '%s': %v, ошибка: %s

source: Failed to determine the package for file '%s'
ru: Не удалось определить пакет для файла '%s'

source: The 'container' field cannot be empty when saving packages to the database
ru: Поле 'контейнер' не может быть пустым при сохранении пакетов в базу данных

source: The database does not have any records, it is necessary to create or update any container
ru: База данных не имеет записей, необходимо создать или обновить любой контейнер

source: The database contains no records, you need to create or update any container
ru: База данных не имеет записей, необходимо создать или обновить любой контейнер

source: No records found for container %s
ru: Не найдено записей для контейнера %s

source: Invalid sort field: %s. Available fields: %s.
ru: Некорректное поле сортировки: %s. Доступные поля: %s.

source: The field %s cannot be updated.
ru: Поле %s не может быть обновлено.

source: Error deleting container records %s: %v
ru: Ошибка удаления записей контейнера %s: %v

source: Invalid filter field: %s. Available fields: %s.
ru: Некорректное поле фильтра: %s. Доступные поля: %s.

source: Failed to retrieve the list of containers:
ru: Не удалось извлечь список контейнеров:

source: Error executing command %q: %s
ru: Ошибка исполнения команды %q: %s

source: Error executing command %q: %v
ru: Ошибка исполнения команды %q: %v

source: Error getting OS information for container %s: %v
ru: Ошибка получения информации об ОС для контейнера %s: %v

source: Error getting OS information for container %s: %s
ru: Ошибка получения информации об ОС для контейнера %s: %s

source: Failed to get the list of containers: %v
ru: Не удалось получить список контейнеров: %v

source: Container %s not found
ru: Контейнер %s не найден

source: Container already exists: %s
ru: Контейнер уже существует: %s

source: Failed to create container %s: %v, stderr: %s
ru: Не удалось создать контейнер %s: %v, ошибка: %s

source: Failed to create container %s: %v
ru: Не удалось создать контейнер %s: %v

source: Failed to delete container %s: %v, stderr: %s
ru: Не удалось удалить контейнер %s: %v, ошибка %s

source: This container is not supported:
ru: Этот контейнер не поддерживается:

source: Failed to retrieve package information: %s
ru: Не удалось извлечь информацию о пакете: %s

source: Error retrieving desktop file path: %v
ru: Ошибка извлечения пути desktop-файла: %v

source: Error retrieving console path: %v
ru: Ошибка извлечения пути консоли: %s

source: A container must be specified for the forced update operation
ru: В контейнере должен быть указан для выполнения операцию принудительного обновления

source: Error retrieving desktop applications for container %s: %v
ru: Ошибка извлечения desktop-файла приложений для контейнера %s: %v

source: Error retrieving console applications for container %s: %v
ru: Ошибка извлечения консольных утилит для контейнера %s: %v

source: Failed to retrieve home directory: %v
ru: Не удалось извлечь домашнюю директорию: %v

source: Error reading directory %s: %v
ru: Ошибка чтения директории %s: %v

source: Error retrieving owner for file %s: %v
ru: Ошибка извлечения владельца для файла %s: %v

source: Error processing file %s: %v
ru: Ошибка обработки файла %s: %v

source: Failed to execute apt search: %v, stderr: %s
ru: Не удалось выполнить apt search: %v, ошибка: %s

source: Failed to retrieve installed packages:
ru: Не удалось извлечь установленные пакеты:

source: No kernels found
ru: Ядра не найдены

source: %d kernel found
ru: %d ядро найдено

source: Current kernel information
ru: Информация об актуальном ядре

source: Kernel flavour must be specified
ru: Необходимо указать разновидность ядра

source: some modules are not available: %s
ru: Некоторые модули недоступны: %s

source: Kernel %s is already installed
ru: Ядро %s уже установлено

source: Installation preview
ru: Предварительный просмотр установки

source: failed to install kernel: %s
ru: Не удалось установить ядро: %s

source: Kernel %s installed successfully
ru: Ядро %s успешно установлено

source: no kernels found for flavour: %s. Remove --flavour option to attempt an automatic upgrade
ru: не найдено ядер для разновидности: %s. Удалите опцию --flavour, чтобы попытаться выполнить автоматическое обновление

source: no kernels found for flavour: %s
ru: не найдено ядер для разновидности: %s

source: Kernel is already up to date
ru: Ядро уже обновлено

source: no kernels found
ru: Ядра не найдены

source: latest for %s
ru: Последний для %s

source: Currently booted
ru: В настоящее время загружен

source: backup kernel
ru: Резервное ядро

source: no old kernels to clean
ru: Нет старых ядер для очистки

source: failed to simulate kernels removal: %s
ru: Не удалось смоделировать удаление ядер: %s

source: Would remove %d old kernel
ru: Удалит %d старое ядро

source: failed to remove kernels: %s
ru: Не удалось удалить ядра: %s

source: Successfully removed %d old kernel
ru: Удалено %d старое ядро

source: %d module found
ru: %d модулей найдено

source: At least one module must be specified
ru: Должен быть указан хотя бы один модуль

source: modules not available: %s
ru: модули недоступны: %s

source: modules already installed: %s
ru: уже установленные модули: %s

source: failed to simulate modules installation: %s
ru: не удалось смоделировать установку модулей: %s

source: Modules installation preview
ru: Предварительный просмотр установки модулей

source: failed to install modules: %s
ru: не удалось установить модули: %s

source: %d module installed successfully for kernel %s
ru: %d модуль успешно установлен для ядра %s

source: module not found: %s
ru: Модуль не найден: %s

source: modules not installed: %s
ru: неустановленные модули: %s

source: No modules to remove
ru: Нет модулей для удаления

source: failed to simulate modules removal: %s
ru: не удалось смоделировать удаление модулей: %s

source: Modules removal preview
ru: Предварительный просмотр удаления модулей

source: failed to remove modules: %s
ru: не удалось удалить модули: %s

source: %d module removed successfully from kernel %s
ru: %d модуль успешно удален из ядра %s

source: Kernel Management. WARNING - experimental module
ru: Управление ядром. ВНИМАНИЕ - экспериментальный модуль

source: List available kernels
ru: Список доступных ядер

source: Filter by kernel flavour (e.g., std-def, un-def)
ru: Фильтр по типу ядра (например, std-def, un-def)

source: Show only installed kernels
ru: Показать только установленные ядра

source: Show information about current kernel
ru: Показать информацию о текущем ядре

source: Install kernel with specified flavour
ru: Установить ядро с указанной разновидностью

source: Install additional kernel modules
ru: Установите дополнительные модули ядра

source: Install kernel headers
ru: Установить заголовки ядра

source: Simulate installation
ru: Симуляция установки

source: Update kernel to latest version
ru: Обновите ядро до последней версии

source: Update to specific flavour (default: current flavour)
ru: Обновление до определенного версии (по умолчанию: текущая разновидность)

source: Simulate update
ru: Симуляция обновления

source: Remove old kernel versions
ru: Удалите старые версии ядра

source: Delete kernels even if it is in 'backup' state
ru: Удалять ядра, даже если они находятся в состоянии «резервного копирования»

source: Show what would be removed without actually removing
ru: Показать, что будет удалено, без фактического удаления

source: Kernel modules management
ru: Управление модулями ядра

source: List available modules for kernel
ru: Список доступных модулей для ядра

source: List modules for specific kernel flavour (default: current flavour)
ru: Список модулей для конкретной версии ядра (по умолчанию: текущая разновидность)

source: Install for specific kernel flavour
ru: Установить для конкретной разновидности ядра

source: Show what would be installed without actually installing
ru: Показать, что будет установлено, без фактической установки

source: Remove kernel modules
ru: Удалить модули ядра

source: Remove from specific kernel flavour
ru: Удалить из конкретной разновидности ядра

source: failed to get current kernel: %s
ru: Не удалось получить текущее ядро: %s

source: failed to parse kernel release: %s
ru: Не удалось проанализировать версию ядра: %s

source: failed to get installed kernels: %s
ru: не удалось установить ядра: %s

source: running kernel %s not found in installed packages
ru: запущенное ядро %s не найдено в установленных пакетах

source: failed to get default kernel: %s
ru: не удалось получить ядро по умолчанию: %s

source: failed to search kernel packages in database: %s
ru: Не удалось найти пакеты ядра в базе данных: %s

source: failed to search kernel modules in database: %s
ru: Не удалось найти модули ядра в базе данных: %s

source: failed to simulate kernel upgrade: %s
ru: Не удалось смоделировать обновление ядра: %s

source: cannot detect current kernel
ru: не удается определить текущее ядро

source: failed to search kernels in database: %s
ru: Не удалось найти ядра в базе данных: %s

source: failed to get available modules from source kernel: %s
ru: не удалось получить доступные модули из исходного ядра: %s

source: failed to get available modules for target kernel: %s
ru: не удалось получить доступные модули для целевого ядра: %s

source: failed to get reboot history: %s
ru: не удалось получить историю перезагрузок: %s

source: %d repository found (including inactive)
ru: Найден %d репозиторий (включая неактивные)

source: %d active repository found
ru: Найден %d активный репозиторий

source: Repository source must be specified
ru: Необходимо указать источник репозитория

source: All repositories already exist
ru: Все репозитории уже существуют

source: %d repository added
ru: Добавлен %d репозиторий

source: Simulation results
ru: Результаты симуляции

source: No repositories found to remove
ru: Не найдено репозиториев для удаления

source: %d repository removed
ru: Удалён %d репозиторий

source: No repositories to remove
ru: Нет репозиториев для удаления

source: Branch name must be specified
ru: Необходимо указать имя ветки

source: Branch %s set successfully
ru: Ветка %s успешно установлена

source: No cdrom or task repositories found
ru: Не найдено cdrom или task репозиториев

source: %d temporary repository removed
ru: Удалён %d временный репозиторий

source: No cdrom or task repositories to remove
ru: Нет cdrom или task репозиториев для удаления

source: Available branches
ru: Доступные ветки

source: Task number must be specified
ru: Необходимо указать номер задачи

source: %d package in task %s
ru: %d пакет в задаче %s

source: No packages to install from task
ru: В задаче нет пакетов для установки

source: Failed to add task repository
ru: Не удалось добавить репозиторий задачи

source: The operation will not make any changes
ru: Операция не будет нести изменений

source: %d package successfully installed
ru: %d пакет успешно установлен

source: and
ru: и

source: %d updated
ru: %d обновлён

source: task
ru: задача

source: Repository management
ru: Управление репозиториями

source: List repositories
ru: Список репозиториев

source: Show all repositories including inactive
ru: Показать все репозитории, включая неактивные

source: Add repository (branch/task/URL)
ru: Добавить репозиторий (ветка/задача/URL)

source: Archive date (YYYYMMDD or YYYY/MM/DD)
ru: Архивная дата (ГГГГММДД или ГГГГ/ММ/ДД)

source: Simulate adding without making changes
ru: Симулировать добавление без внесения изменений

source: Remove repository. Use 'all' to remove all repositories, or specify branch/task/URL
ru: Удалить репозиторий. Используйте 'all', чтобы удалить все репозитории, или укажите branch/task/URL

source: Simulate removal without making changes
ru: Симулировать удаление без внесения изменений

source: Set branch (removes all existing and adds specified branch)
ru: Установить ветку (удаляет все существующие и добавляет указанную)

source: Simulate setting without making changes
ru: Симулировать установку без внесения изменений

source: Remove all cdrom and task repositories
ru: Удалить все cdrom и task репозитории

source: Simulate cleaning without making changes
ru: Симулировать очистку без внесения изменений

source: List available branches
ru: Список доступных веток

source: Show packages in task
ru: Показать пакеты в задаче

source: Install packages from task for testing
ru: Установить пакеты из задачи для тестирования
